# 算数运算符
"""
+加 -减 *乘 /除
% 取余数 9%2=1
// 取整除 9//2=4
** 幂(最高优先级) 2**3=8  
在 Python 中 `*` 运算符还可以用于字符串，计算结果就是字符串重复指定次数的结果
“-”* 5  
结果如下：
'-----'
"""

# 比较运算符
"""
==
!=
>
<
>=
<=
"""

# 逻辑运算符
"""
and
or
not
"""

# 赋值运算符
"""
=
+=  :  c += a 等效于 c = c + a
-=  :  c -= a 等效于 c = c - a
*=  :  c *= a 等效于 c = c * a
/=  :  c /= a 等效于 c = c / a
//= :  c //= a 等效于 c = c // a
**= :  c **= a 等效于 c = c ** a
%=  :  c %= a 等效于 c = c % a
"""

# 运算符优先级
# 由高到低
"""
| **                       | 幂 (最高优先级)        |
| ------------------------ | ----------------------|
| * / % //                 | 乘、除、取余数、取整除  |
| + -                      | 加法、减法             |
| <= < > >=                | 比较运算符             |
| == !=                    | 等于运算符             |
| = %= /= //= -= += *= **= | 赋值运算符             |
| not or and               |                       |
"""